# https://zh.wikipedia.org/zh-cn/%E7%BB%B4%E5%90%BE%E5%B0%94%E8%80%81%E6%96%87%E5%AD%97


character = [
    "ا", "ە", "ب", "پ", "ت", "ج", "چ", "خ", "د", "ر", "ز", "ژ", "س", "ش", "غ", "ف", "ق", "ك", "گ", "ڭ",
    "ل", "م", "ن", "ھ", "و", "ۆ", "ۈ", "ۇ", "ۋ", "ې", "ى", "ئ", "ي",
]

character_all = [
    'ئا', 'ا', 'ئە', 'ە', 'ب', 'پ', 'ت', 'ج', 'چ', 'خ', 'د', 'ر',
    'ز', 'ژ', 'س', 'ش', 'غ', 'ف', 'ق', 'ك', 'گ', 'ڭ', 'ل', 'م',
    'ن', 'ھ', 'ئو', 'و', 'ئۇ', 'ۇ', 'ئۆ', 'ۆ', 'ئۈ', 'ۈ', 'ۋ',
    'ئې', 'ې', 'ئى', 'ى', 'ي'
]

character_count = len(character)
character_count_all = len(character_all)

# 元音列表
vowels = [
    "ا", "ە", "و", "ۆ", "ۈ", "ۇ", "ې", "ى", "ئ"
]

vowels_all = [
    'ئا', 'ا', 'ئە', 'ە', 'ئو', 'و', 'ئۇ', 'ۇ', 'ئۆ', 'ۆ', 'ئۈ', 'ۈ', 'ئې', 'ې', 'ئى', 'ى'
]
# 辅音列表
consonants = [
    "ب", "پ", "ت", "ج", "چ", "خ", "د", "ر", "ز", "ژ", "س", "ش", "غ", "ف", "ق", "ك", "گ", "ڭ",
    "ل", "م", "ن", "ھ", "ۋ", "ي"
]

consonants_all = [
    'ب', 'پ', 'ت', 'ج', 'چ', 'خ', 'د', 'ر', 'ز', 'ژ', 'س', 'ش', 'غ',
    'ف', 'ق', 'ك', 'گ', 'ڭ', 'ل', 'م', 'ن', 'ھ', 'ۋ', 'ي'
]
# 标点符号列表
punctuation = [
    "،", "۔", "؟", "!", ":", "؛", ";", "«", "»", "(", ")", "[", "]", "{", "}", "—", "…"
]

# 元音
international_vowels = 'ɑaɛæoɔuʊøyʏeiɨ'
international_pulmonic_consonants = 'bptdʒtʃχxdrɾzʒsʃʁɣfɸqkgŋlmnhɦwvj'

# 维吾尔语字母与国际音标映射关系

international_to_ipa = {
    'ئا': 'ɑ', 'ا': 'ɑ',
    'ئە': 'ɛ', 'ە': 'æ',
    'ب': 'b',
    'پ': 'p',
    'ت': 't',
    'ج': 'dʒ',
    'چ': 'tʃ',
    'خ': 'x',
    'د': 'd',
    'ر': 'r',
    'ز': 'z',
    'ژ': 'ʒ',
    'س': 's',
    'ش': 'ʃ',
    'غ': 'ʁ',
    'ف': 'f',
    'ق': 'q',
    'ك': 'k',
    'گ': 'g',
    'ڭ': 'ŋ',
    'ل': 'l',
    'م': 'm',
    'ن': 'n',
    'ھ': 'h',
    'ئو': 'o', 'و': 'ɔ',
    'ئۇ': 'u', 'ۇ': 'ʊ',
    'ئۆ': 'ø',
    'ئۈ': 'y', 'ۈ': 'ʏ',
    'ۋ': 'w',
    'ئې': 'e',
    'ئى': 'i', 'ى': 'ɨ',
    'ي': 'j'
}


international_to_ipa_all = {
    'ئا': 'ɑ', 'ا': 'a',
    'ئە': 'ɛ', 'ە': 'æ',
    'ب': 'b',
    'پ': 'p',
    'ت': 't',
    'ج': 'dʒ',
    'چ': 'tʃ',
    'خ': 'x',
    'د': 'd',
    'ر': 'r',
    'ز': 'z',
    'ژ': 'ʒ',
    'س': 's',
    'ش': 'ʃ',
    'غ': 'ʁ',
    'ف': 'f',
    'ق': 'q',
    'ك': 'k',
    'گ': 'g',
    'ڭ': 'ŋ',
    'ل': 'l',
    'م': 'm',
    'ن': 'n',
    'ھ': 'h',
    'ئو': 'o', 'و': 'ɔ',
    'ئۇ': 'u', 'ۇ': 'ʊ',
    'ئۆ': 'ø',
    'ئۈ': 'y', 'ۈ': 'ʏ',
    'ۋ': 'w',
    'ئې': 'e',
    'ئى': 'i', 'ى': 'ɨ',
    'ي': 'j'
}

if __name__ == "__main__":
    pass
