# symbols.py

money_symbols_mapping = {
    "$": "دوللار",  # 美元符号
    "¥": "يۈەن",    # 人民币符号
    "€": "ياۋرو",  # 欧元符号
    "£": "پونډ",    # 英镑符号
    "₩": "ۋون",    # 韩元符号
    "₽": "رۇبل",   # 卢布符号
    "₹": "روپىيە",  # 印度卢比符号
    "₺": "ليرا",    # 土耳其里拉符号
    "₫": "دوڭ",    # 越南盾符号
}


punctuation_mapping = {
    "،": ",",
    "۔": ".",
    "؟": "?",
    "!": "!",
    ":": ":",
    "؛": ";",
    "«": '"',
    "»": '"',
    "(": "(",
    ")": ")",
    "[": "[",
    "]": "]",
    "{": "{",
    "}": "}",
    "—": "-",
    "…": "..."
}