

# 字母
character  =  [
    "ا", "ە", "ب", "پ", "ت", "ج", "چ", "خ", "د","ر", "ز","ژ", "س","ش","غ","ف","ق","ك", "گ","ڭ",
    "ل", "م","ن","ھ","و","ۆ","ۈ","ۇ","ۋ","ې","ئ","ي",
]

# 元音列表
vowels = [
    "ا", "ە", "و", "ۆ", "ۈ", "ۇ", "ې", "ئ", "ي"
]

# 辅音列表
consonants = [
    "ب", "پ", "ت", "ج", "چ", "خ", "د", "ر", "ز", "ژ", "س", "ش", "غ", "ف", "ق", "ك", "گ", "ڭ",
    "ل", "م", "ن", "ھ", "ۋ"
]


# 标点符号列表
punctuation = [
    "،", "۔", "؟", "!", ":", ";", "(", ")", "[", "]", "{", "}", "—", "…"
]

# 元音
_vowels = 'aəeıiöüu'

vowel_mapping = {
    'a': 'ا',
    'ə': 'ە',
    'e': 'ې',
    'ı': 'ى',
    'i': 'ي',
    'ö': 'ۆ',
    'ü': 'ۈ',
    'u': 'ۇ'
}

# 维吾尔语辅音与 _pulmonic_consonants 的映射
_pulmonic_consonants = 'bptdkgqxmʁʃʒfvszmnŋlrwjhʔ'

consonant_mapping = {
    'b': 'ب',
    'p': 'پ',
    't': 'ت',
    'd': 'د',
    'k': 'ك',
    'g': 'گ',
    'q': 'ق',
    'x': 'خ',
    'm': 'م',
    'n': 'ن',
    'ʁ': 'غ',
    'ʃ': 'ش',
    'ʒ': 'ج',  # 发音类似于英语中的“j”
    'f': 'ف',
    'v': 'ۋ',
    's': 'س',
    'z': 'ز',
    'l': 'ل',
    'r': 'ر',
    'w': 'ۋ',  # 维吾尔语中的“w”通常用“ۋ”表示
    'j': 'ي',
    'h': 'ھ',
    'ʔ': 'ئ',
    'tʃ': 'چ'   # 添加 'tʃ' 映射到 'چ'
}
